module.exports.config = {
  name: 'autosent',
  version: '10.02',
  hasPermssion: 0,
  credits: 'SHAAN-KHAN',
  description: 'Set Karne Ke Bad Automatically Msg Send Karega (Kolkata Time)',
  commandCategory: 'group messenger',
  usages: '[]',
  cooldowns: 3
};

const nam = [
  {
    timer: '12:00:00 AM',
    message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐇𝐚𝐢 12:00 A𝐌 ⏳            क्या मैंने कभी सोचा था कि सपनों का पीछा करते हुए मैं खुद को खो दूंगा?\nमगर यह क्या, जब मैंने खुद को पाया तो सारे सपने कहीं खो गए।                 ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝑺𝑯𝑨𝑨𝑵 𝑲𝑯𝑨𝑵★']
  },
  {
    timer: '1:00:00 AM',
    message: ['──── •💜• ────     𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 1:00 A𝐌 ⏳           दिलों में तन्हाई है,\nफिर भी उम्मीदें हमेशा दिल को जिंदा रखती हैं।\nजो सीधी राह पर चलेगा वो जरूर कुछ रोशनी पाएगा।              ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝑺𝑯𝑨𝑨𝑵 𝑲𝑯𝑨𝑵★']
  },
  {
    timer: '2:00:00 AM',
    message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 2:00 A𝐌 ⏳             जब हम गिरते हैं तो दुनिया की नजरों में हमारी कद्र बढ़ जाती है,\nक्योंकि यह हमें दोबारा खड़े होने की ताकत देता है।          ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝑺𝑯𝑨𝑨𝑵 𝑲𝑯𝑨𝑵★']
  },
  {
    timer: '3:00:00 AM',
    message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 3:00 A𝐌 ⏳             हम जो चाहते हैं वो आसानी से नहीं मिलता\nलेकिन जब हम मेहनत और सब्र करते हैं तो यह सबसे कीमती होता है।              ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝑺𝑯𝑨𝑨𝑵 𝑲𝑯𝑨𝑵★']
  },
  {
    timer: '4:00:00 AM',
    message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 4:00 A𝐌 ⏳              अकेलेपन में खुद को कभी तनहा मत समझो\nक्योंकि दुनिया का सबसे बड़ा दोस्त आपका आत्मविश्वास है।          ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝑺𝑯𝑨𝑨𝑵 𝑲𝑯𝑨𝑵★']
  },
  {
    timer: '5:00:00 AM',
    message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 5:00 A𝐌 ⏳ हर इंसान के दिल में एक कहानी होती है\nजिसे कभी कोई नहीं जानता,\nक्योंकि वो कहानी सिर्फ उस इंसान के दिल में रहती है।\n.      ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝑺𝑯𝑨𝑨𝑵 𝑲𝑯𝑨𝑵★']
  },
  {
    timer: '6:00:00 AM',
    message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 6:00 A𝐌 ⏳            हर मोड़ पर नया रास्ता ढूंढता हूँ\nक्योंकि मैं उन रास्तों पर नहीं चलता जो पहले से तयशुदा हों।             ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝑺𝑯𝑨𝑨𝑵 𝑲𝑯𝑨𝑵★']
  },
  {
    timer: '7:00:00 AM',
    message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 7:00 A𝐌 ⏳             खुश रहना और मुस्कुराना सबसे बड़ी ताकत है\nक्योंकि यह दर्द को कम करता है और जिंदगी को आसान बनाता है।🕊️                 ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝑺𝑯𝑨𝑨𝑵 𝑲𝑯𝑨𝑵★']
  },
  {
    timer: '8:00:00 AM',
    message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 8:00 A𝐌 ⏳            जिंदगी में मुश्किलें आती हैं, लेकिन अगर हम उनके साथ हंसते हुए चलें तो वो हमें कभी हारने नहीं देतीं।                  ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝑺𝑯𝑨𝑨𝑵 𝑲𝑯𝑨𝑵★']
  },
  {
    timer: '9:00:00 AM',
    message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 9:00 A𝐌 ⏳            अच्छे बुरे वक्त का मिलना किसी के बस में नहीं होता\nलेकिन जो इसे कबूल करता है वही असली विजेता है।                ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝑺𝑯𝑨𝑨𝑵 𝑲𝑯𝑨𝑵★']
  },
  {
    timer: '10:00:00 AM',
    message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 10:00 A𝐌 ⏳           जिंदगी की सबसे अच्छी बात यह है कि वक्त जो भी गुजर जाए\nवो कभी वापस नहीं आता, इसलिए जितना हो सके जियो।             ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝑺𝑯𝑨𝑨𝑵 𝑲𝑯𝑨𝑵★']
  },
  {
    timer: '11:00:00 AM',
    message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 11:00 A𝐌 ⏳            लोग अक्सर मुझे खुश रहने को कहते हैं,\nलेकिन उनकी समझ में नहीं आता कि मुस्कुराहट के पीछे कितनी कहानियां छिपी हैं।               ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝑺𝑯𝑨𝑨𝑵 𝑲𝑯𝑨𝑵★']
  },
  {
    timer: '12:00:00 PM',
    message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 12:00 P𝐌 ⏳            हमें छोड़ने वाले,\nहम उनके बिना भी जी सकते हैं\nलेकिन जो दिल से जुड़े रहते हैं वो कभी नहीं जाते।               ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝑺𝑯𝑨𝑨𝑵 𝑲𝑯𝑨𝑵★']
  },
  {
    timer: '1:00:00 PM',
    message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 1:00 P𝐌 ⏳            कभी-कभी हमारी खामोशी हमारी सबसे बड़ी आवाज़ बन जाती है\nक्योंकि उस आवाज़ में सच्चाई और दर्द होता है।            ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝑺𝑯𝑨𝑨𝑵 𝑲𝑯𝑨𝑵★']
  },
  {
    timer: '2:00:00 PM',
    message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 2:00 P𝐌 ⏳            जिंदगी की राहें आसान नहीं\nहर किसी का दिल कभी न कभी टूटता है\nलेकिन जो दिल टूटकर जुड़ा हो वो सबसे मजबूत होता है।                 ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝑺𝑯𝑨𝑨𝑵 𝑲𝑯𝑨𝑵★']
  },
  {
    timer: '3:00:00 PM',
    message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 3:00 P𝐌 ⏳            उम्मीद के बारे में क्या, यह हर रोज टूटती है और फिर से बनती है।\nबस इसे पकड़ कर रखो क्योंकि यही तुम्हारी ताकत है।                   ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝑺𝑯𝑨𝑨𝑵 𝑲𝑯𝑨𝑵★']
  },
  {
    timer: '4:00:00 PM',
    message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 4:00 P𝐌 ⏳                 इंसान अपने हालात का गुलाम नहीं होता\nआपकी नियत सबसे बड़ी है।\nजो कभी हार नहीं मानता वही सबसे ज्यादा जीतता है।                     ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝑺𝑯𝑨𝑨𝑵 𝑲𝑯𝑨𝑵★']
  },
  {
    timer: '5:00:00 PM',
    message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 5:00 P𝐌 ⏳            जो अपने सपने पूरे दिल से जीता है\nवो अपनी जिंदगी में कभी हार नहीं सकता।\nहार सिर्फ वही लोग मानते हैं जो अपनी उम्मीदें छोड़ देते हैं।                       ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝑺𝑯𝑨𝑨𝑵 𝑲𝑯𝑨𝑵★']
  },
  {
    timer: '6:00:00 PM',
    message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 6:00 P𝐌 ⏳                 जिंदगी बहुत छोटी है,\nलेकिन कभी-कभी हम अपने सपनों को पूरा करने में इतनी देर लगा देते हैं कि हम जीने का सही तरीका भूल जाते हैं।              ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝑺𝑯𝑨𝑨𝑵 𝑲𝑯𝑨𝑵★']
  },
  {
    timer: '7:00:00 PM',
    message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 7:00 P𝐌 ⏳             हमेशा याद रखना,\nदुःख और खुशी दोनों वक्त की तरह हैं।\nजब एक आता है तो दूसरा भी जल्द आता है।\nइसलिए कभी अकेला महसूस न करें।                ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝑺𝑯𝑨𝑨𝑵 𝑲𝑯𝑨𝑵★']
  },
  {
    timer: '8:00:00 PM',
    message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 8:00 P𝐌 ⏳             जो गुजर गया उसे भूल जाओ\nअभी क्या है उस पर ध्यान दो।\nआज आपकी मेहनत ही,\nआपके कल का चेहरा बनाएगी।               ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝑺𝑯𝑨𝑨𝑵 𝑲𝑯𝑨𝑵★']
  },
  {
    timer: '9:00:00 PM',
    message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 9:00 P𝐌 ⏳              इंसान खुद को उसी दिन समझता है\nजिस दिन वो दूसरों के बारे में सोचना छोड़ देता है।\nक्योंकि दूसरों के बारे में सोचते हुए हम अपने आप को खो देते हैं।🕊️                                ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝑺𝑯𝑨𝑨𝑵 𝑲𝑯𝑨𝑵★']
  },
  {
    timer: '10:00:00 PM',
    message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 10:00 P𝐌 ⏳                  जिंदगी की सबसे बड़ी सजा\nकिसी को दिल से प्यार करने के बाद उसे खोना पड़ता है।\nलेकिन यह वो वक्त होता है जब इंसान सबसे मजबूत होता है।                 ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝑺𝑯𝑨𝑨𝑵 𝑲𝑯𝑨𝑵★']
  },
  {
    timer: '11:00:00 PM',
    message: ['──── •💜• ────                𝐀𝐛𝐡𝐢 𝐓𝐢𝐦𝐞 𝐡𝐚𝐢 11:00 P𝐌 ⏳              जिंदगी में हमेशा खुश रहने की कोशिश करो\nक्योंकि जब आप खुश होते हैं तो दुनिया आपके साथ होती है।\nऔर जब आप उदास होते हैं तो दुनिया भी दूर चली जाती है।                     ──── •💜• ────»»𝐎𝐖𝐍𝐄𝐑««★𝑺𝑯𝑨𝑨𝑵 𝑲𝑯𝑨𝑵★']
  }
];

module.exports.onLoad = o => setInterval(() => {
  const r = a => a[Math.floor(Math.random() * a.length)];
  
  // Kolkata TimeZone Logic
  const currentTime = new Date().toLocaleString("en-US", { timeZone: "Asia/Kolkata" }).split(/,/).pop().trim();
  
  if (á = nam.find(i => i.timer == currentTime)) {
    global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
  }
}, 1000);

module.exports.run = o => {};
